# ResultClass

ResultClass object

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.result_class import ResultClass

# TODO update the JSON string below
json = "{}"
# create an instance of ResultClass from a JSON string
result_class_instance = ResultClass.from_json(json)
# print the JSON string representation of the object
print(ResultClass.to_json())

# convert the object into a dict
result_class_dict = result_class_instance.to_dict()
# create an instance of ResultClass from a dict
result_class_from_dict = ResultClass.from_dict(result_class_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)